PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_scb.h
/***************************************************************************//**
* \file cyip_scb.h
*
* \brief
* SCB IP definitions
*
********************************************************************************
* \copyright
* (c) (2016-2025), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#ifndef _CYIP_SCB_H_
#define _CYIP_SCB_H_

#include "cyip_headers.h"

/*******************************************************************************
*                                     SCB
*******************************************************************************/

#define SCB_SECTION_SIZE                        0x00010000UL

/**
  * \brief Serial Communications Block (SPI/UART/I2C) (CySCB)
  */
typedef struct
{
    __IOM uint32_t CTRL;                          /*!< 0x00000000 Generic control */
    __IM uint32_t STATUS;                        /*!< 0x00000004 Generic status */
    __IOM uint32_t CMD_RESP_CTRL;                 /*!< 0x00000008 Command/response control */
    __IM uint32_t CMD_RESP_STATUS;               /*!< 0x0000000C Command/response status */
    __IM uint32_t RESERVED[4];
    __IOM uint32_t SPI_CTRL;                      /*!< 0x00000020 SPI control */
    __IM uint32_t SPI_STATUS;                    /*!< 0x00000024 SPI status */
    __IOM uint32_t SPI_TX_CTRL;                   /*!< 0x00000028 SPI transmitter control */
    __IOM uint32_t SPI_RX_CTRL;                   /*!< 0x0000002C SPI receiver control */
    __IM uint32_t RESERVED1[4];
    __IOM uint32_t UART_CTRL;                     /*!< 0x00000040 UART control */
    __IOM uint32_t UART_TX_CTRL;                  /*!< 0x00000044 UART transmitter control */
    __IOM uint32_t UART_RX_CTRL;                  /*!< 0x00000048 UART receiver control */
    __IM uint32_t UART_RX_STATUS;                /*!< 0x0000004C UART receiver status */
    __IOM uint32_t UART_FLOW_CTRL;                /*!< 0x00000050 UART flow control */
    __IM uint32_t RESERVED2[3];
    __IOM uint32_t I2C_CTRL;                      /*!< 0x00000060 I2C control */
    __IM uint32_t I2C_STATUS;                    /*!< 0x00000064 I2C status */
    __IOM uint32_t I2C_M_CMD;                     /*!< 0x00000068 I2C master command */
    __IOM uint32_t I2C_S_CMD;                     /*!< 0x0000006C I2C slave command */
    __IOM uint32_t I2C_CFG;                       /*!< 0x00000070 I2C configuration */
    __IOM uint32_t I2C_STRETCH_CTRL;              /*!< 0x00000074 I2C stretch control */
    __IM uint32_t I2C_STRETCH_STATUS;            /*!< 0x00000078 I2C stretch status */
    __IM uint32_t RESERVED3;
    __IOM uint32_t I2C_CTRL_HS;                   /*!< 0x00000080 I2C control for High-Speed mode */
    __IM uint32_t RESERVED4[95];
    __IOM uint32_t TX_CTRL;                       /*!< 0x00000200 Transmitter control */
    __IOM uint32_t TX_FIFO_CTRL;                  /*!< 0x00000204 Transmitter FIFO control */
    __IM uint32_t TX_FIFO_STATUS;                /*!< 0x00000208 Transmitter FIFO status */
    __IM uint32_t RESERVED5[13];
    __OM uint32_t TX_FIFO_WR;                    /*!< 0x00000240 Transmitter FIFO write */
    __IM uint32_t RESERVED6[47];
    __IOM uint32_t RX_CTRL;                       /*!< 0x00000300 Receiver control */
    __IOM uint32_t RX_FIFO_CTRL;                  /*!< 0x00000304 Receiver FIFO control */
    __IM uint32_t RX_FIFO_STATUS;                /*!< 0x00000308 Receiver FIFO status */
    __IM uint32_t RESERVED7;
    __IOM uint32_t RX_MATCH;                      /*!< 0x00000310 Slave address and mask */
    __IM uint32_t RESERVED8[11];
    __IM uint32_t RX_FIFO_RD;                    /*!< 0x00000340 Receiver FIFO read */
    __IM uint32_t RX_FIFO_RD_SILENT;             /*!< 0x00000344 Receiver FIFO read silent */
    __IM uint32_t RESERVED9[46];
    __IOM uint32_t EZ_DATA[512];                  /*!< 0x00000400 Memory buffer */
    __IM uint32_t RESERVED10[128];
    __IM uint32_t INTR_CAUSE;                    /*!< 0x00000E00 Active clocked interrupt signal */
    __IM uint32_t RESERVED11[31];
    __IOM uint32_t INTR_I2C_EC;                   /*!< 0x00000E80 Externally clocked I2C interrupt request */
    __IM uint32_t RESERVED12;
    __IOM uint32_t INTR_I2C_EC_MASK;              /*!< 0x00000E88 Externally clocked I2C interrupt mask */
    __IM uint32_t INTR_I2C_EC_MASKED;            /*!< 0x00000E8C Externally clocked I2C interrupt masked */
    __IM uint32_t RESERVED13[12];
    __IOM uint32_t INTR_SPI_EC;                   /*!< 0x00000EC0 Externally clocked SPI interrupt request */
    __IM uint32_t RESERVED14;
    __IOM uint32_t INTR_SPI_EC_MASK;              /*!< 0x00000EC8 Externally clocked SPI interrupt mask */
    __IM uint32_t INTR_SPI_EC_MASKED;            /*!< 0x00000ECC Externally clocked SPI interrupt masked */
    __IM uint32_t RESERVED15[12];
    __IOM uint32_t INTR_M;                        /*!< 0x00000F00 Master interrupt request */
    __IOM uint32_t INTR_M_SET;                    /*!< 0x00000F04 Master interrupt set request */
    __IOM uint32_t INTR_M_MASK;                   /*!< 0x00000F08 Master interrupt mask */
    __IM uint32_t INTR_M_MASKED;                 /*!< 0x00000F0C Master interrupt masked request */
    __IM uint32_t RESERVED16[12];
    __IOM uint32_t INTR_S;                        /*!< 0x00000F40 Slave interrupt request */
    __IOM uint32_t INTR_S_SET;                    /*!< 0x00000F44 Slave interrupt set request */
    __IOM uint32_t INTR_S_MASK;                   /*!< 0x00000F48 Slave interrupt mask */
    __IM uint32_t INTR_S_MASKED;                 /*!< 0x00000F4C Slave interrupt masked request */
    __IM uint32_t RESERVED17[12];
    __IOM uint32_t INTR_TX;                       /*!< 0x00000F80 Transmitter interrupt request */
    __IOM uint32_t INTR_TX_SET;                   /*!< 0x00000F84 Transmitter interrupt set request */
    __IOM uint32_t INTR_TX_MASK;                  /*!< 0x00000F88 Transmitter interrupt mask */
    __IM uint32_t INTR_TX_MASKED;                /*!< 0x00000F8C Transmitter interrupt masked request */
    __IM uint32_t RESERVED18[12];
    __IOM uint32_t INTR_RX;                       /*!< 0x00000FC0 Receiver interrupt request */
    __IOM uint32_t INTR_RX_SET;                   /*!< 0x00000FC4 Receiver interrupt set request */
    __IOM uint32_t INTR_RX_MASK;                  /*!< 0x00000FC8 Receiver interrupt mask */
    __IM uint32_t INTR_RX_MASKED;                /*!< 0x00000FCC Receiver interrupt masked request */
} CySCB_Type;                                   /*!< Size = 4048 (0xFD0) */


